###################################################################

# Created by write_sdc on Mon May 19 10:26:18 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_operating_conditions -max ss0p7v125c -max_library saed32hvt_ss0p7v125c -min ff1p16vn40c -min_library saed32lvt_ff1p16vn40c
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports scan_clk]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports scan_rst]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports test_mode]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports SI]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports SE]
set_driving_cell -lib_cell NBUFFX32_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports i_dig_tx_system_clk32]
set_driving_cell -lib_cell NBUFFX32_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports i_dig_tx_system_clk26]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports i_dig_tx_system_rst_n]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports i_dig_tx_system_data_in]
set_driving_cell -lib_cell NBUFFX2_RVT -library saed32rvt_ss0p7v125c -pin Y [get_ports i_dig_tx_system_csn]
set_load -pin_load 0.05 [get_ports SO]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_data_out]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_crc_valid]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_regfile_valid]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_output_valid]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[7]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[6]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[5]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[4]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[3]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[2]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[1]}]
set_load -pin_load 0.05 [get_ports {o_dig_tx_system_data_slave_out[0]}]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_done]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_miso_ena]
set_load -pin_load 0.05 [get_ports o_dig_tx_system_miso]
create_clock [get_ports i_dig_tx_system_clk32]  -name sys_clock  -period 1.42  -waveform {0 0.71}
set_clock_uncertainty -setup 0.25  [get_clocks sys_clock]
set_clock_uncertainty -hold 0.15  [get_clocks sys_clock]
create_clock [get_ports i_dig_tx_system_clk26]  -name spi_clock  -period 2  -waveform {0 1}
set_clock_uncertainty -setup 0.25  [get_clocks spi_clock]
set_clock_uncertainty -hold 0.15  [get_clocks spi_clock]
create_generated_clock [get_pins u_dig_tx_sys_clock_gating/o_dig_tx_clock_gating_gated_clock]  -name sys_gated_clk  -source [get_ports i_dig_tx_system_clk32]  -master_clock sys_clock  -divide_by 1  -add
set_clock_uncertainty -setup 0.25  [get_clocks sys_gated_clk]
set_clock_uncertainty -hold 0.15  [get_clocks sys_gated_clk]
create_generated_clock [get_pins u_dig_tx_spi_clock_gating/o_dig_tx_clock_gating_gated_clock]  -name spi_gated_clk  -source [get_ports i_dig_tx_system_clk26]  -master_clock spi_clock  -divide_by 1  -add
set_clock_uncertainty -setup 0.25  [get_clocks spi_gated_clk]
set_clock_uncertainty -hold 0.15  [get_clocks spi_gated_clk]
group_path -name INOUT  -from [list [get_ports scan_clk] [get_ports scan_rst] [get_ports test_mode] [get_ports SI] [get_ports SE] [get_ports i_dig_tx_system_clk32] [get_ports i_dig_tx_system_clk26] [get_ports i_dig_tx_system_rst_n] [get_ports i_dig_tx_system_data_in] [get_ports i_dig_tx_system_csn]]  -to [list [get_ports SO] [get_ports o_dig_tx_system_data_out] [get_ports o_dig_tx_system_crc_valid] [get_ports o_dig_tx_system_regfile_valid] [get_ports o_dig_tx_system_output_valid] [get_ports {o_dig_tx_system_data_slave_out[7]}] [get_ports {o_dig_tx_system_data_slave_out[6]}] [get_ports {o_dig_tx_system_data_slave_out[5]}] [get_ports {o_dig_tx_system_data_slave_out[4]}] [get_ports {o_dig_tx_system_data_slave_out[3]}] [get_ports {o_dig_tx_system_data_slave_out[2]}] [get_ports {o_dig_tx_system_data_slave_out[1]}] [get_ports {o_dig_tx_system_data_slave_out[0]}] [get_ports o_dig_tx_system_done] [get_ports o_dig_tx_system_miso_ena] [get_ports o_dig_tx_system_miso]]
group_path -name INREG  -from [list [get_ports scan_clk] [get_ports scan_rst] [get_ports test_mode] [get_ports SI] [get_ports SE] [get_ports i_dig_tx_system_clk32] [get_ports i_dig_tx_system_clk26] [get_ports i_dig_tx_system_rst_n] [get_ports i_dig_tx_system_data_in] [get_ports i_dig_tx_system_csn]]
group_path -name REGOUT  -to [list [get_ports SO] [get_ports o_dig_tx_system_data_out] [get_ports o_dig_tx_system_crc_valid] [get_ports o_dig_tx_system_regfile_valid] [get_ports o_dig_tx_system_output_valid] [get_ports {o_dig_tx_system_data_slave_out[7]}] [get_ports {o_dig_tx_system_data_slave_out[6]}] [get_ports {o_dig_tx_system_data_slave_out[5]}] [get_ports {o_dig_tx_system_data_slave_out[4]}] [get_ports {o_dig_tx_system_data_slave_out[3]}] [get_ports {o_dig_tx_system_data_slave_out[2]}] [get_ports {o_dig_tx_system_data_slave_out[1]}] [get_ports {o_dig_tx_system_data_slave_out[0]}] [get_ports o_dig_tx_system_done] [get_ports o_dig_tx_system_miso_ena] [get_ports o_dig_tx_system_miso]]
set_input_delay -clock spi_gated_clk  0.4  [get_ports scan_clk]
set_input_delay -clock spi_gated_clk  0.4  [get_ports scan_rst]
set_input_delay -clock spi_gated_clk  0.4  [get_ports test_mode]
set_input_delay -clock spi_gated_clk  0.4  [get_ports SI]
set_input_delay -clock spi_gated_clk  0.4  [get_ports SE]
set_input_delay -clock spi_gated_clk  0.4  [get_ports i_dig_tx_system_rst_n]
set_input_delay -clock spi_gated_clk  0.4  [get_ports i_dig_tx_system_data_in]
set_input_delay -clock spi_gated_clk  0.4  [get_ports i_dig_tx_system_csn]
set_output_delay -clock sys_gated_clk  0.284  [get_ports o_dig_tx_system_data_out]
set_output_delay -clock sys_gated_clk  0.284  [get_ports o_dig_tx_system_crc_valid]
set_output_delay -clock sys_clock  0.284  [get_ports o_dig_tx_system_regfile_valid]
set_output_delay -clock sys_clock  0.284  [get_ports o_dig_tx_system_output_valid]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[7]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[6]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[5]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[4]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[3]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[2]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[1]}]
set_output_delay -clock spi_gated_clk  0.284  [get_ports {o_dig_tx_system_data_slave_out[0]}]
set_output_delay -clock sys_clock  0.284  [get_ports o_dig_tx_system_done]
set_output_delay -clock spi_gated_clk  0.284  [get_ports o_dig_tx_system_miso_ena]
set_output_delay -clock spi_gated_clk  0.284  [get_ports o_dig_tx_system_miso]
set_clock_groups -asynchronous -name sys_clock_1 -group [list [get_clocks sys_clock] [get_clocks sys_gated_clk]] -group [list [get_clocks spi_clock] [get_clocks spi_gated_clk]]
